const ar = {
  translation: {
    الرئيسية: "الرئيسية",
    التحديات: "التحديات",
    المتصدرين: "المتصدرين",
    التقدم: "التقدم",
    البروفايل: "البروفايل",

    "سجل الآن وابدأ": "سجل الآن وابدأ",
    "رحلة الإحسان": "رحلة الإحسان",

    "هيا بنا نصنع الخير معًا!": "هيا بنا نصنع الخير معًا!",
    "تقدم حسناتك": "تقدم حسناتك",
    مرحباً: "مرحباً",
    "سنابل الإحسان": "سنابل الإحسان",
    "سنبلة الصيام": "سنبلة الصيام",
    "سنبلة الصدقة": "سنبلة الصدقة",
    "سنبلة الصلاة": "سنبلة الصلاة",
    "عرض الكل": "عرض الكل",

    متابعة: "متابعة",
    تخطي: "تخطي",
    "سنابل الإحسان هو تطبيق تفاعلي يعزز القيم النبيلة للأطفال":
      "سنابل الإحسان هو تطبيق تفاعلي يعزز القيم النبيلة للأطفال",
    "تغيير اللغة": "تغيير اللغة",

    // Onboarding translations
    "مرحباً بك في": "مرحباً بك في",
    "👋سنابل الإحسان": "👋سنابل الإحسان",
    "ازرع سنبلة تُثمر": "ازرع سنبلة تُثمر",
    "خيراً وأجراً": "خيراً وأجراً",
    "تسابقوا إلى": "تسابقوا إلى",
    "الخيرات، فإنها لا تدوم": "الخيرات، فإنها لا تدوم",
    "إغتنم الفرص لفعل الخير، فالحسنات تتضاعف مع كل عمل صالح":
      "إغتنم الفرص لفعل الخير، فالحسنات تتضاعف مع كل عمل صالح",
    "لا تفوّت الفرصة لفعل الخير، فالأجر يعمّ والحسنات تُكتب":
      "لا تفوّت الفرصة لفعل الخير، فالأجر يعمّ والحسنات تُكتب",

    // ChangePassword component translations
    "8 أحرف كحد أدنى": "8 أحرف كحد أدنى",
    رقم: "رقم",
    رمز: "رمز",
    "إعادة تعيين كلمة السر": "إعادة تعيين كلمة السر",
    "تأمين حسابك بكلمة مرور جديدة": "تأمين حسابك بكلمة مرور جديدة",
    "ادخل كلمة السر": "ادخل كلمة السر",
    "كلمة السر": "كلمة السر",
    حفظ: "حفظ",
    "ليس لديك حساب؟": "ليس لديك حساب؟",
    "إنشاء حساب": "إنشاء حساب",
    "تم تغير كلمة السر بنجاح": "تم تغير كلمة السر بنجاح",
    "قم بتسجيل الدخول و ابدأ في جمع الحسنات":
      "قم بتسجيل الدخول و ابدأ في جمع الحسنات",
    "تسجيل الدخول": "تسجيل الدخول",

    // ForgotPassword component translations
    "التحقق من البريد الإلكتروني": "التحقق من البريد الإلكتروني",
    "هل نسيت كلمة السر؟": "هل نسيت كلمة السر؟",
    "أدخل بريدك الالكتروني لإعادة تعيين كلمة السر":
      "أدخل بريدك الالكتروني لإعادة تعيين كلمة السر",
    "لقد أرسلنا للتو الرمز المكون من 4 أرقام إلى":
      "لقد أرسلنا للتو الرمز المكون من 4 أرقام إلى",
    "أدخله أدناه:": "أدخله أدناه:",
    الرمز: "الرمز",
    "البريد الإلكتروني": "البريد الإلكتروني",
    "تأكيد الرمز": "تأكيد الرمز",
    "ارسل الرمز": "ارسل الرمز",
    "لم تتلق رمز": "لم تتلق رمز",
    "بعد؟": "بعد؟",
    "إعادة الإرسال": "إعادة الإرسال",
    email_example: "مثال: amrahmed@gmail.com",

    // Login component translations

    "سجل الآن واستمتع بتجربة تفاعلية تبني العطاء والانتماء":
      "سجل الآن واستمتع بتجربة تفاعلية تبني العطاء والانتماء",

    "حفظ الحساب": "حفظ الحساب",

    // Signup process
    "انشاء حساب جديد": "انشاء حساب جديد",
    "هل لديك حساب؟": "هل لديك حساب؟",
    "انشاء حساب واستمتع بتجربة تفاعلية تبني العطاء والانتماء":
      "انشاء حساب واستمتع بتجربة تفاعلية تبني العطاء والانتماء",
    "ادخل اسمك واسم والدك": "ادخل اسمك واسم والدك",
    "اكمل حسابك واستمتع بتجربة تفاعلية تبني العطاء والانتماء":
      "اكمل حسابك واستمتع بتجربة تفاعلية تبني العطاء والانتماء",
    اسمك: "اسمك",
    "اسمك الأول": "اسمك الأول",
    "اسم والدك": "اسم والدك",
    "اختار النوع (بنت - ولد)": "اختار النوع (بنت - ولد)",
    ولد: "ولد",
    بنت: "بنت",
    "ادخل تاريخ عيد ميلادك 🎂": "ادخل تاريخ عيد ميلادك 🎂",
    اليوم: "اليوم",
    الشهر: "الشهر",
    السنة: "السنة",
    "اختار مرحلتك الدراسية 🎓": "اختار مرحلتك الدراسية 🎓",
    الابتدائي: "الابتدائي",
    الاعدادي: "الاعدادي",
    الثانوي: "الثانوي",
    "ادخل رمز لولي امرك": "ادخل رمز لولي امرك",
    "رمز الوالدين": "رمز الوالدين",
    "اصنع رمز لوالديك حتي يمكنهم تحرير تقدمك":
      "اصنع رمز لوالديك حتي يمكنهم تحرير تقدمك",
    "اضع صورة شخصية لك": "اضع صورة شخصية لك",
    "أبدا رحلة جمع الحسنات": "أبدا رحلة جمع الحسنات",

    // login toaster messages
    fill_all_fields: "يرجى ملء جميع الحقول",
    invalid_email: "البريد الإلكتروني غير صالح",
    short_password: "كلمة المرور يجب أن تكون 8 أحرف على الأقل",
    login_successful: "تم تسجيل الدخول بنجاح!",
    login_failed:
      "فشل تسجيل الدخول. البريد الإلكتروني أو كلمة المرور غير صحيحة.",

    // Signup OTP toaster messages
    otpSentSuccess: "تم إرسال الرمز بنجاح!",
    enter4DigitOTP: "يرجى إدخال رمز مكون من 4 أرقام.",
    otpVerifySuccess: "تم التحقق من الرمز بنجاح!",
    invalidOTP: "الرمز غير صحيح. حاول مرة أخرى.",
    passwordNotMeetRequirements: "كلمة المرور لا تلبي جميع المتطلبات.",
    passwordChangeFailed: "فشل تغيير كلمة المرور. يرجى المحاولة مرة أخرى.",
    fillEmailField: "يرجى ملء حقل البريد الإلكتروني.",
    invalidEmailFormat: "صيغة البريد الإلكتروني غير صالحة.",

    "Create Password": "إنشاء كلمة مرور",
    "Secure your account with a strong password": "أمّن حسابك بكلمة مرور قوية",

    // FIRST AND LAST NAME ERRORS

    enterFirstNameAndParentName: "يرجى إدخال اسمك واسم والدك",
    noNumbersOrSymbols: "يرجى إدخال أحرف فقط دون أرقام أو رموز",
    emptyFieldError: "هذا الحقل مطلوب",

    // Birthdate
    numbers_only: "يرجى إدخال الأرقام فقط",
    invalid_date: "يرجى إدخال تاريخ صحيح",
    enter_birthdate: "أدخل تاريخ ميلادك 🎂",
    complete_account: "أكمل حسابك للاستمتاع بتجربة مميزة",
    year: "السنة",
    month: "الشهر",
    day: "اليوم",
    continue: "متابعة",

    year_out_of_range: "يجب أن تكون السنة بين 1940 والسنة الحالية",
    four_digit_year: "يجب أن تكون السنة مكونة من أربعة أرقام",

    "ولي امر او  معلم": "ولي امر او  معلم",
    طالب: "طالب",

    //signup parent or teacher
    "اختر نوع التسجيل": "اختر نوع التسجيل",

    ERROR: "خطأ",

    pleaseSelectRole: "يرجى اختيار دور",
    pleaseSelectAvatar: "يرجى اختيار صورة رمزية",
    Parent: "ولي أمر",
    Teacher: "معلم",
    Male: "ذكر",
    Female: "أنثى",
    "اسمك الاخير": "اسمك الاخير",

    // Profile page
    "تغيير الي الانجليزية": "تغيير الي الانجليزية",
    "تغيير الي العربية": "تغيير الي العربية",
    "تغيير كلمة المرور": "تغيير كلمة المرور",
    "سياسة الخصوصية": "سياسة الخصوصية",
    "مركز المساعدة": "مركز المساعدة",
    "تفعيل الوضع الداكن": "تفعيل الوضع الداكن",
    "تسجيل الخروج": "تسجيل الخروج",
    حسنة: "حسنة",
    "تعديل الملف الشخصي": "تعديل الملف الشخصي",
    "حذف الحساب": "حذف الحساب",
    "هل تريد حذف الحساب؟": "هل تريد حذف الحساب؟",
    "تأكد من عدم إمكانية التراجع عن هذا الإجراء":
      "تأكد من عدم إمكانية التراجع عن هذا الإجراء",
    إلغاء: "إلغاء",
    حذف: "حذف",

    alreadyPassed: "قد مضى بالفعل",
    timeLeft: "  متبقية  {{hours}} ساعة {{minutes}}دقيقة",

    المستوى: "المستوى",

    // Other Trophies

    "Tree Stage": "مرحلة الشجرة",
    "Progress Tree": "شجرة التقدم",
    "Missions Finished": "المهام المكتملة",
    "Total Blue Points": "السنبلة الزرقاء",
    "Total Yellow Points": "السنبلة الصفراء",
    "Total Red Points": "السنبلة الحمراء",
    "Total Mixed Points": " سنابل الإحسان",
    "Total XP": " الـ XP",
    "Total Water Bought": "الماء",
    "Total Fertilizer Bought": "سماد",
  },
};

export default ar;
