import trophies from "./TrophiesImgs";

const titles = [
  "إدخال السرور",
  "الشكر",
  "إكرام الضيف",
  "الصبر",
  "إيناس الوحشان وترك التناجي",
  "الصدق والأمانة",
  "الإحسان للأرض والنبات",
  "الصدقة",
  "الإحسان للجار",
  "الصلاة",
  "الصيام",
  "الإحسان للجسد",
  "العفو",
  "الإحسان للروح",
  "الإحسان للعقل",
  "الإحسان للقلب",
  "الغرس",
  "الكلمة الطيبة والإحسان في القول",
  "الإصلاح بين متخاصمين",
  "المشاركة والإيثار",
  "الإطعام",
  "الإحسان للمخلوقات الطيور والحيوانات",
  "الوفاء والامتنان",
  "إماتة الأذى",
  "التبسم وإفشاء السلام",
  "بر الوالدين",
  "التعاون",
  "توقير الكبير ورحمة الصغير",
  "التهادي",
  "صلة الرحم",
  "الدعاء",
  "الذكر",
  "الرحمة والرفق",
  "عدم الإسراف",
  "قضاء الحوائج",
];

const counts = [5, 10, 25, 50, 75, 100];

const trophiesData = titles.map((title, index) => ({
  title,
  img: trophies[index],
  count: counts[Math.floor(Math.random() * counts.length)],
}));

export default trophiesData;
